# AceleraDev Codenation - Semana 2 | Data Science

### Manipulando dados

In [2]:
# importando bibliotecas

#o principal framework para manipulação dos dados
import pandas as pd 

import numpy as np

In [3]:
#acessando o help dos pacotes
pd?

### Dicionários

In [4]:
#criando um dicionário de dados
dados = {'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
        'acessos': [100, 200, 300, 400, 500],
        'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
         'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [5]:
#printar o dicionário
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [6]:
#verificando o tipo do dicionário
type(dados)

dict

In [7]:
#acessando as chaves do dicionário
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [8]:
#acessando uma chave especifica
dados['canal_venda']

['facebook', 'twitter', 'instagram', 'linkedin', 'facebook']

In [9]:
#acessando a posição especifica de um dicionário
dados['canal_venda'][2]

'instagram'

In [10]:
#acessando a posição especifica de um dicionário
dados['canal_venda'][2:]

['instagram', 'linkedin', 'facebook']

In [11]:
#acessando a posição especifica de um dicionário
dados['canal_venda'][:2]

['facebook', 'twitter']

### Listas

In [12]:
#verificando tipo
type([1,2,3])

list

In [13]:
#criando uma lista
lista = [200, 200, 800, 200, 300]

In [14]:
#printando lista
lista

[200, 200, 800, 200, 300]

In [15]:
#vendo valores especificos
lista[2]

800

In [16]:
#fatia da lista
lista[:2]

[200, 200]

In [17]:
#adicionando lista ao dicionário
dados['lista'] = lista

In [18]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 800, 200, 300]}

### DataFrame

In [19]:
pd

In [20]:
#criando dataframe a partir de um dict
dataframe=pd.DataFrame(dados)

In [21]:
#acessando o dataframe
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    800
3    linkedin      400  site2  5000.00    200
4    facebook      500  site3   300.00    300

In [22]:
#printando os primeiros casos do dataframe
dataframe.head(1)

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200

In [23]:
#verificando o formato do data
dataframe.shape

(5, 5)

In [24]:
#verificando o indice do dataframe
dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [25]:
#verificando o tipo dos dados no dataframe
dataframe.dtypes

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

In [26]:
dataframe.dtypes.value_counts()

object     2
int64      2
float64    1
dtype: int64

In [27]:
#verificando se existem valores faltantes
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False  False   False  False

In [28]:
dataframe.isna().sum()

canal_venda    0
acessos        0
site           0
vendas         0
lista          0
dtype: int64

In [29]:
#printando nome das colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [30]:
#acessando uma coluna especifica
dataframe['canal_venda']

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_venda, dtype: object

In [31]:
#transformando em lista
list(dataframe['canal_venda'])

['facebook', 'twitter', 'instagram', 'linkedin', 'facebook']

In [32]:
#criando uma nova coluna
#dataframe['nova_coluna']=[1,2,3,4,None]
dataframe['nova_coluna']=[1,2,3,4,5]

In [33]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    800            3
3    linkedin      400  site2  5000.00    200            4
4    facebook      500  site3   300.00    300            5

In [34]:
#removendo colunas
dataframe.drop(columns = 'nova_coluna', inplace=True)

In [35]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [36]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    800
3    linkedin      400  site2  5000.00    200
4    facebook      500  site3   300.00    300

In [37]:
#removendo mais de uma coluna
dataframe.drop(columns = ['canal_venda','acessos'])

    site   vendas  lista
0  site1  1000.52    200
1  site1  1052.34    200
2  site2  2002.00    800
3  site2  5000.00    200
4  site3   300.00    300

In [38]:
#acessando valores especificos de uma coluna
dataframe['canal_venda'][2]

'instagram'

In [39]:
#acessando uma fatia especifica
dataframe['canal_venda'][3:]

3    linkedin
4    facebook
Name: canal_venda, dtype: object

In [40]:
#fatiando os dados usando iloc (linnhas / colunas)
dataframe.iloc[:2,2:]

    site   vendas  lista
0  site1  1000.52    200
1  site1  1052.34    200

In [41]:
#fatiar os dados usando loc (indice)
dataframe.loc[:3]

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    800
3    linkedin      400  site2  5000.00    200

In [42]:
#selecionando colunas especificas
dataframe[['canal_venda', 'acessos']]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [43]:
#passando os valores atraves de lista
filtro=['canal_venda', 'acessos']

In [44]:
dataframe[filtro]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [45]:
#usando o método info
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
canal_venda    5 non-null object
acessos        5 non-null int64
site           5 non-null object
vendas         5 non-null float64
lista          5 non-null int64
dtypes: float64(1), int64(2), object(2)
memory usage: 280.0+ bytes

In [46]:
#pivotando os dados (coluna)
aux = dataframe.pivot(index='canal_venda', columns ='site', values='acessos')

In [47]:
aux

site         site1  site2  site3
canal_venda
facebook     100.0    NaN  500.0
instagram      NaN  300.0    NaN
linkedin       NaN  400.0    NaN
twitter      200.0    NaN    NaN

In [48]:
aux.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, facebook to twitter
Data columns (total 3 columns):
site1    2 non-null float64
site2    2 non-null float64
site3    1 non-null float64
dtypes: float64(3)
memory usage: 128.0+ bytes

In [49]:
#completando valores faltante com fillna
aux.fillna(0)

site         site1  site2  site3
canal_venda
facebook     100.0    0.0  500.0
instagram      0.0  300.0    0.0
linkedin       0.0  400.0    0.0
twitter      200.0    0.0    0.0

In [50]:
#mudando as colunas usando o comando melt
dataframe.melt(id_vars='site',value_vars='canal_venda')

    site     variable      value
0  site1  canal_venda   facebook
1  site1  canal_venda    twitter
2  site2  canal_venda  instagram
3  site2  canal_venda   linkedin
4  site3  canal_venda   facebook

In [51]:
#resetando o indice do dataframe
print(aux.columns)
#aux=dataframe.reset_index()
#print(aux.columns)

Index(['site1', 'site2', 'site3'], dtype='object', name='site')

In [52]:
#exemplo do comando melt
#aux.melt(id_vars='canal_venda', value_vars=['site1', 'site2','site3'])

In [53]:
#somando colunas do dataframe
dataframe.sum()

canal_venda    facebooktwitterinstagramlinkedinfacebook
acessos                                            1500
site                          site1site1site2site2site3
vendas                                          9354.86
lista                                              1700
dtype: object

In [54]:
#somando linhas do dataframe
dataframe.sum(axis=1)

0    1300.52
1    1452.34
2    3102.00
3    5600.00
4    1100.00
dtype: float64

In [55]:
#calculando a mediana das colunas numéricas

print('Por Linha: ',dataframe.median(axis=1))

Por Linha:  0    200.0
1    200.0
2    800.0
3    400.0
4    300.0
dtype: float64

In [56]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    800
3    linkedin      400  site2  5000.00    200
4    facebook      500  site3   300.00    300

In [57]:
print('Por Coluna: ',dataframe.median())

Por Coluna:  acessos     300.00
vendas     1052.34
lista       200.00
dtype: float64

In [58]:
#calculando a média das colunas numéricas
dataframe.mean()

acessos     300.000
vendas     1870.972
lista       340.000
dtype: float64

In [59]:
#calculando o desvio padrão das colunas numéricas
dataframe.std()

acessos     158.113883
vendas     1850.931024
lista       260.768096
dtype: float64

In [60]:
#comando describe que calcula estatistica descritivas para colunas numéricas
dataframe.describe()

          acessos       vendas       lista
count    5.000000     5.000000    5.000000
mean   300.000000  1870.972000  340.000000
std    158.113883  1850.931024  260.768096
min    100.000000   300.000000  200.000000
25%    200.000000  1000.520000  200.000000
50%    300.000000  1052.340000  200.000000
75%    400.000000  2002.000000  300.000000
max    500.000000  5000.000000  800.000000

In [94]:
#calculando a moda
dataframe.mode()

,canal_venda,acessos,site,vendas,lista,categoria_venda,categoria_acessos
0,facebook,100,site1,300.00,200.0,0 a 1500,menor_que_300
1,NaN,200,site2,1000.52,NaN,NaN,NaN
2,NaN,300,NaN,1052.34,NaN,NaN,NaN
3,NaN,400,NaN,2002.00,NaN,NaN,NaN
4,NaN,500,NaN,5000.00,NaN,NaN,NaN

In [62]:
#valor máximo por coluna
dataframe.max()

canal_venda    twitter
acessos            500
site             site3
vendas            5000
lista              800
dtype: object

In [63]:
#valor mínimo da coluna
dataframe.min()

canal_venda    facebook
acessos             100
site              site1
vendas              300
lista               200
dtype: object

In [64]:
#printando o número de unicos
dataframe.nunique()

canal_venda    4
acessos        5
site           3
vendas         5
lista          3
dtype: int64

In [65]:
#contando valores unicos de uma coluna
dataframe['canal_venda'].value_counts()

facebook     2
twitter      1
instagram    1
linkedin     1
Name: canal_venda, dtype: int64

In [66]:
#valores unicos de uam coluna
dataframe['canal_venda'].unique()

array(['facebook', 'twitter', 'instagram', 'linkedin'], dtype=object)

In [97]:
#usando groupby com valores númericos
dataframe.groupby('site')['acessos'].sum()

site
site1    300
site2    700
site3    500
Name: acessos, dtype: int64

In [95]:
dataframe

,canal_venda,acessos,site,vendas,lista,categoria_venda,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,800,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,200,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,300,0 a 1500,maior_que_300

In [68]:
#usando groupby com valores númericos
dataframe.groupby('canal_venda')['acessos'].mean()

canal_venda
facebook     300
instagram    300
linkedin     400
twitter      200
Name: acessos, dtype: int64

In [69]:
#usando groupbr com variaveis categóricas
dataframe.groupby('site')['canal_venda'].unique()

site
site1      [facebook, twitter]
site2    [instagram, linkedin]
site3               [facebook]
Name: canal_venda, dtype: object

In [70]:
#usando groupbr com variaveis categóricas
dataframe.groupby('site')['canal_venda'].first()

site
site1     facebook
site2    instagram
site3     facebook
Name: canal_venda, dtype: object

In [71]:
#usando groupby com a função agg
dataframe.groupby('canal_venda').agg({'site':'unique',
                                     'acessos':'sum'})

                       site  acessos
canal_venda
facebook     [site1, site3]      600
instagram           [site2]      300
linkedin            [site2]      400
twitter             [site1]      200

In [72]:
#correlação entre as variáveis
dataframe.corr()

          acessos    vendas     lista
acessos  1.000000  0.217542  0.121268
vendas   0.217542  1.000000 -0.040650
lista    0.121268 -0.040650  1.000000

In [73]:
dataframe['categoria_venda']=pd.cut(dataframe['vendas'],
                                    bins=(0, 1500, 2000, 8000),
                                    labels=('0 a 1500','1500 a 2000', '2000 a 8000'))

In [74]:
dataframe

  canal_venda  acessos   site   vendas  lista categoria_venda
0    facebook      100  site1  1000.52    200        0 a 1500
1     twitter      200  site1  1052.34    200        0 a 1500
2   instagram      300  site2  2002.00    800     2000 a 8000
3    linkedin      400  site2  5000.00    200     2000 a 8000
4    facebook      500  site3   300.00    300        0 a 1500

In [75]:
#usando váriavel categórica usando compreensão de lista
dataframe['categoria_acessos']=['maior_que_300' if x>300 else 'menor_que_300' for x in dataframe['acessos']]

In [76]:
#dataframe['categoria_acessos2']=pd.cut(dataframe['acessos'],
                                   # bins=(0, 300,600),
                                    #labels=('menor_que_300','maior_que_300'))

In [77]:
#juntando dois dataframe / criando dataframe_2
dataframe_2=pd.DataFrame({'site':['site1', 'site1', 'site2', 'site2', 'site3'], 
                         'suporte':['Carlos','Carlos','Maria','Maria', 'Ezequiel']})

In [78]:
dataframe_2

    site   suporte
0  site1    Carlos
1  site1    Carlos
2  site2     Maria
3  site2     Maria
4  site3  Ezequiel

In [79]:
dataframe.merge(dataframe_2, on='site', how='left')

,canal_venda,acessos,site,vendas,lista,categoria_venda,categoria_acessos,suporte
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
1,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
2,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
3,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
4,instagram,300,site2,2002.00,800,2000 a 8000,menor_que_300,Maria
5,instagram,300,site2,2002.00,800,2000 a 8000,menor_que_300,Maria
6,linkedin,400,site2,5000.00,200,2000 a 8000,maior_que_300,Maria
7,linkedin,400,site2,5000.00,200,2000 a 8000,maior_que_300,Maria
8,facebook,500,site3,300.00,300,0 a 1500,maior_que_300,Ezequiel

In [80]:
#salvando dataframe como csv
dataframe.to_csv('dataframe.csv', sep=';', decimal=',', index=False)

In [81]:
#lendo dados no formato csv
dataframe_lido=pd.read_csv('dataframe.csv', sep=';', decimal=',')

In [82]:
dataframe_lido.head()

,canal_venda,acessos,site,vendas,lista,categoria_venda,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,800,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,200,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,300,0 a 1500,maior_que_300

### Imputação de dados

In [83]:
df=pd.read_csv('train.csv')

In [84]:
aux=pd.DataFrame({'colunas':df.columns,
                 'tipo':df.dtypes,
                 'percentual_faltantes':df.isna().sum()/df.shape[0]})

In [85]:
aux

                 colunas     tipo  percentual_faltantes
PassengerId  PassengerId    int64              0.000000
Survived        Survived    int64              0.000000
Pclass            Pclass    int64              0.000000
Name                Name   object              0.000000
Sex                  Sex   object              0.000000
Age                  Age  float64              0.198653
SibSp              SibSp    int64              0.000000
Parch              Parch    int64              0.000000
Ticket            Ticket   object              0.000000
Fare                Fare  float64              0.000000
Cabin              Cabin   object              0.771044
Embarked        Embarked   object              0.002245

In [86]:
#dados númericos: média ou mediana
df['Age']=df['Age'].fillna(df['Age'].mean())

In [87]:
#dados categóricos: unknown ou moda
df['Cabin'] = df['Cabin'].fillna('Unknown')

In [88]:
df['Cabin'].value_counts()

Unknown        687
B96 B98          4
G6               4
C23 C25 C27      4
D                3
E101             3
F33              3
C22 C26          3
F2               3
E33              2
C124             2
C2               2
E121             2
C123             2
E44              2
C65              2
C52              2
B51 B53 B55      2
E67              2
C83              2
D35              2
F4               2
B22              2
B49              2
C92              2
B20              2
F G73            2
B35              2
B28              2
B5               2
              ...
C46              1
B86              1
B101             1
B102             1
D50              1
C62 C64          1
A19              1
C104             1
B79              1
A36              1
B4               1
C70              1
F38              1
T                1
E17              1
D21              1
D48              1
D6               1
C118             1
D49              1
A34              1
D45              1
C7               1
E68              1
C30              1
C85              1
E58              1
C47              1
C50              1
C32              1
Name: Cabin, Length: 148, dtype: int64

In [89]:
df.shape[0]

891